Bunkering_10/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2406                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];
internalField   uniform 293.15; // 20 degC ambient air, per notional_nozzle_reduced_velocity_plan.md

boundaryField
{
    right               { type inletOutlet; inletValue uniform 293.15; value $internalField; }
    left                { type inletOutlet; inletValue uniform 293.15; value $internalField; }
    front               { type inletOutlet; inletValue uniform 293.15; value $internalField; }
    back                { type inletOutlet; inletValue uniform 293.15; value $internalField; }
    top                 { type inletOutlet; inletValue uniform 293.15; value $internalField; }
    bottom              { type zeroGradient; }
    bunkering-boat_m    { type zeroGradient; }
    bunkering-quay_larger_m    { type zeroGradient; }
    nozzle_holder_wall  { type zeroGradient; }
    nozzle              { type fixedValue; value uniform 285.15; } // 12 degC H2 storage gas temperature
}
// ************************************************************************* //
